
with source as (
    select * from {{ source('jpdcledw_integration', '"wqwt34明細出力リスト"') }}
),

final as (
select  
"売上no",
	"得意先コード",
	"得意先名",
	"得意先名略",
	"得意先名カナ",
	"受注区分",
	"アイテム区分",
	"アイテム区分名",
	"専用伝票番号",
	"商品コード",
	"janコード",
	"取引先品目コード",
	"商品名",
	"バラ数量",
	"単価",
	"金額",
	"小売単価",
	"対象月次締日",
	"都道府県別集計用",
	"得意先名2",
	"地区名称",
	"千趣会除2",
	"統合商品名",
	"品目分類値コード1",
	"集計用名称",
	"販促単価",
	"販促費抽出",
	"集計用得意先名",
	"廃盤品目コード",
	"納品日",
	"出荷日",
	"プロセスタイプコード",
	"受注番号",
	"取引区分",
	"得意先属性付与no",
	"請求先名",
	"請求先コード",
	"売上区分",
	"伝票税抜合計金額",
	"消費税等金額",
	"伝票総合計金額",
	"得意先向備考メモ",
	"代表出荷先コード",
	"代表出荷先名",
	"消費税率"
from source
)

select * from final